"%[Any]@ of the following are true" = "%1$[Any]@ of the following are true";
"%[All]@ of the following are true" = "%1$[All]@ of the following are true";

"%[bitrate]@ %[is]@ %@ kbps" = "%1$[Bit Rate]@ %2$[is]@ %3$@ kbps";
"%[bitrate]@ %[is not]@ %@ kbps" = "%1$[Bit Rate]@ %2$[is not]@ %3$@ kbps";
"%[bitrate]@ %[is greater than]@ %@ kbps" = "%1$[Bit Rate]@ %2$[is greater than]@ %3$@ kbps";
"%[bitrate]@ %[is less than]@ %@ kbps" = "%1$[Bit Rate]@ %2$[is less than]@ %3$@ kbps";
"%[bitrate]@ %[is in the range]@ %@ to %@ %[kbps]@" = "%1$[Bit Rate]@ %2$[is in the range]@ %3$@ to %4$@ %5$[kbps]@";

"%[sample_rate]@ %[is]@ %@ Hz" = "%1$[Sample Rate]@ %2$[is]@ %3$@ Hz";
"%[sample_rate]@ %[is not]@ %@ Hz" = "%1$[Sample Rate]@ %2$[is not]@ %3$@ Hz";
"%[sample_rate]@ %[is greater than]@ %@ Hz" = "%1$[Sample Rate]@ %2$[is greater than]@ %3$@ Hz";
"%[sample_rate]@ %[is less than]@ %@ Hz" = "%1$[Sample Rate]@ %2$[is less than]@ %3$@ Hz";
"%[sample_rate]@ %[is in the range]@ %@ to %@ %[Hz]@" = "%1$[Sample Rate]@ %2$[is in the range]@ %3$@ to %4$@ %5$[Hz]@";

"%[bpm]@ %[is]@ %@" = "%1$[BPM]@ %2$[is]@ %3$@";
"%[bpm]@ %[is not]@ %@" = "%1$[BPM]@ %2$[is not]@ %3$@";
"%[bpm]@ %[is greater than]@ %@" = "%1$[BPM]@ %2$[is greater than]@ %3$@";
"%[bpm]@ %[is less than]@ %@" = "%1$[BPM]@ %2$[is less than]@ %3$@";
"%[bpm]@ %[is in the range]@ %@ to %@" = "%1$[BPM]@ %2$[is in the range]@ %3$@ to %4$@";

"%[disc_number]@ %[is]@ %@" = "%1$[Disc Number]@ %2$[is]@ %3$@";
"%[disc_number]@ %[is not]@ %@" = "%1$[Disc Number]@ %2$[is not]@ %3$@";
"%[disc_number]@ %[is greater than]@ %@" = "%1$[Disc Number]@ %2$[is greater than]@ %3$@";
"%[disc_number]@ %[is less than]@ %@" = "%1$[Disc Number]@ %2$[is less than]@ %3$@";
"%[disc_number]@ %[is in the range]@ %@ to %@" = "%1$[Disc Number]@ %2$[is in the range]@ %3$@ to %4$@";

"%[userplaycount]@ %[is]@ %@" = "%1$[Plays]@ %2$[is]@ %3$@";
"%[userplaycount]@ %[is not]@ %@" = "%1$[Plays]@ %2$[is not]@ %3$@";
"%[userplaycount]@ %[is greater than]@ %@" = "%1$[Plays]@ %2$[is greater than]@ %3$@";
"%[userplaycount]@ %[is less than]@ %@" = "%1$[Plays]@ %2$[is less than]@ %3$@";
"%[userplaycount]@ %[is in the range]@ %@ to %@" = "%1$[Plays]@ %2$[is in the range]@ %3$@ to %4$@";

"%[season]@ %[is]@ %@" = "%1$[Season]@ %2$[is]@ %3$@";
"%[season]@ %[is not]@ %@" = "%1$[Season]@ %2$[is not]@ %3$@";
"%[season]@ %[is greater than]@ %@" = "%1$[Season]@ %2$[is greater than]@ %3$@";
"%[season]@ %[is less than]@ %@" = "%1$[Season]@ %2$[is less than]@ %3$@";
"%[season]@ %[is in the range]@ %@ to %@" = "%1$[Season]@ %2$[is in the range]@ %3$@ to %4$@";

"%[userskipcount]@ %[is]@ %@" = "%1$[Skips]@ %2$[is]@ %3$@";
"%[userskipcount]@ %[is not]@ %@" = "%1$[Skips]@ %2$[is not]@ %3$@";
"%[userskipcount]@ %[is greater than]@ %@" = "%1$[Skips]@ %2$[is greater than]@ %3$@";
"%[userskipcount]@ %[is less than]@ %@" = "%1$[Skips]@ %2$[is less than]@ %3$@";
"%[userskipcount]@ %[is in the range]@ %@ to %@" = "%1$[Skips]@ %2$[is in the range]@ %3$@ to %4$@";

"%[track_number]@ %[is]@ %@" = "%1$[Track Number]@ %2$[is]@ %3$@";
"%[track_number]@ %[is not]@ %@" = "%1$[Track Number]@ %2$[is not]@ %3$@";
"%[track_number]@ %[is greater than]@ %@" = "%1$[Track Number]@ %2$[is greater than]@ %3$@";
"%[track_number]@ %[is less than]@ %@" = "%1$[Track Number]@ %2$[is less than]@ %3$@";
"%[track_number]@ %[is in the range]@ %@ to %@" = "%1$[Track Number]@ %2$[is in the range]@ %3$@ to %4$@";

"%[year]@ %[is]@ %@" = "%1$[Year]@ %2$[is]@ %3$@";
"%[year]@ %[is not]@ %@" = "%1$[Year]@ %2$[is not]@ %3$@";
"%[year]@ %[is greater than]@ %@" = "%1$[Year]@ %2$[is greater than]@ %3$@";
"%[year]@ %[is less than]@ %@" = "%1$[Year]@ %2$[is less than]@ %3$@";
"%[year]@ %[is in the range]@ %@ to %@" = "%1$[Year]@ %2$[is in the range]@ %3$@ to %4$@";

"%[totalsize]@ %[is]@ %@ MB" = "%1$[Size]@ %2$[is]@ %3$@ MB";
"%[totalsize]@ %[is not]@ %@ MB" = "%1$[Size]@ %2$[is not]@ %3$@ MB";
"%[totalsize]@ %[is greater than]@ %@ MB" = "%1$[Size]@ %2$[is greater than]@ %3$@ MB";
"%[totalsize]@ %[is less than]@ %@ MB" = "%1$[Size]@ %2$[is less than]@ %3$@ MB";
"%[totalsize]@ %[is in the range]@ %@ to %@ %[MB]@" = "%1$[Size]@ %2$[is in the range]@ %3$@ to %4$@ %5$[MB]@";

"%[album]@ %[contains]@ %@" = "%1$[Album]@ %2$[contains]@ %3$@";
"%[album]@ %[does not contain]@ %@" = "%1$[Album]@ %2$[does not contain]@ %3$@";
"%[album]@ %[is]@ %@" = "%1$[Album]@ %2$[is]@ %3$@";
"%[album]@ %[is not]@ %@" = "%1$[Album]@ %2$[is not]@ %3$@";
"%[album]@ %[begins with]@ %@" = "%1$[Album]@ %2$[begins with]@ %3$@";
"%[album]@ %[ends with]@ %@" = "%1$[Album]@ %2$[ends with]@ %3$@";

"%[album_artist]@ %[contains]@ %@" = "%1$[Album Artist]@ %2$[contains]@ %3$@";
"%[album_artist]@ %[does not contain]@ %@" = "%1$[Album Artist]@ %2$[does not contain]@ %3$@";
"%[album_artist]@ %[is]@ %@" = "%1$[Album Artist]@ %2$[is]@ %3$@";
"%[album_artist]@ %[is not]@ %@" = "%1$[Album Artist]@ %2$[is not]@ %3$@";
"%[album_artist]@ %[begins with]@ %@" = "%1$[Album Artist]@ %2$[begins with]@ %3$@";
"%[album_artist]@ %[ends with]@ %@" = "%1$[Album Artist]@ %2$[ends with]@ %3$@";

"%[artist]@ %[contains]@ %@" = "%1$[Artist]@ %2$[contains]@ %3$@";
"%[artist]@ %[does not contain]@ %@" = "%1$[Artist]@ %2$[does not contain]@ %3$@";
"%[artist]@ %[is]@ %@" = "%1$[Artist]@ %2$[is]@ %3$@";
"%[artist]@ %[is not]@ %@" = "%1$[Artist]@ %2$[is not]@ %3$@";
"%[artist]@ %[begins with]@ %@" = "%1$[Artist]@ %2$[begins with]@ %3$@";
"%[artist]@ %[ends with]@ %@" = "%1$[Artist]@ %2$[ends with]@ %3$@";

"%[category]@ %[contains]@ %@" = "%1$[Category]@ %2$[contains]@ %3$@";
"%[category]@ %[does not contain]@ %@" = "%1$[Category]@ %2$[does not contain]@ %3$@";
"%[category]@ %[is]@ %@" = "%1$[Category]@ %2$[is]@ %3$@";
"%[category]@ %[is not]@ %@" = "%1$[Category]@ %2$[is not]@ %3$@";
"%[category]@ %[begins with]@ %@" = "%1$[Category]@ %2$[begins with]@ %3$@";
"%[category]@ %[ends with]@ %@" = "%1$[Category]@ %2$[ends with]@ %3$@";

"%[comments]@ %[contains]@ %@" = "%1$[Comments]@ %2$[contains]@ %3$@";
"%[comments]@ %[does not contain]@ %@" = "%1$[Comments]@ %2$[does not contain]@ %3$@";
"%[comments]@ %[is]@ %@" = "%1$[Comments]@ %2$[is]@ %3$@";
"%[comments]@ %[is not]@ %@" = "%1$[Comments]@ %2$[is not]@ %3$@";
"%[comments]@ %[begins with]@ %@" = "%1$[Comments]@ %2$[begins with]@ %3$@";
"%[comments]@ %[ends with]@ %@" = "%1$[Comments]@ %2$[ends with]@ %3$@";

"%[composer]@ %[contains]@ %@" = "%1$[Composer]@ %2$[contains]@ %3$@";
"%[composer]@ %[does not contain]@ %@" = "%1$[Composer]@ %2$[does not contain]@ %3$@";
"%[composer]@ %[is]@ %@" = "%1$[Composer]@ %2$[is]@ %3$@";
"%[composer]@ %[is not]@ %@" = "%1$[Composer]@ %2$[is not]@ %3$@";
"%[composer]@ %[begins with]@ %@" = "%1$[Composer]@ %2$[begins with]@ %3$@";
"%[composer]@ %[ends with]@ %@" = "%1$[Composer]@ %2$[ends with]@ %3$@";

"%[debug]@ %[contains]@ %@" = "%1$[Debug]@ %2$[contains]@ %3$@";
"%[debug]@ %[does not contain]@ %@" = "%1$[Debug]@ %2$[does not contain]@ %3$@";
"%[debug]@ %[is]@ %@" = "%1$[Debug]@ %2$[is]@ %3$@";
"%[debug]@ %[is not]@ %@" = "%1$[Debug]@ %2$[is not]@ %3$@";
"%[debug]@ %[begins with]@ %@" = "%1$[Debug]@ %2$[begins with]@ %3$@";
"%[debug]@ %[ends with]@ %@" = "%1$[Debug]@ %2$[ends with]@ %3$@";

"%[description]@ %[contains]@ %@" = "%1$[Description]@ %2$[contains]@ %3$@";
"%[description]@ %[does not contain]@ %@" = "%1$[Description]@ %2$[does not contain]@ %3$@";
"%[description]@ %[is]@ %@" = "%1$[Description]@ %2$[is]@ %3$@";
"%[description]@ %[is not]@ %@" = "%1$[Description]@ %2$[is not]@ %3$@";
"%[description]@ %[begins with]@ %@" = "%1$[Description]@ %2$[begins with]@ %3$@";
"%[description]@ %[ends with]@ %@" = "%1$[Description]@ %2$[ends with]@ %3$@";

"%[genre]@ %[contains]@ %@" = "%1$[Genre]@ %2$[contains]@ %3$@";
"%[genre]@ %[does not contain]@ %@" = "%1$[Genre]@ %2$[does not contain]@ %3$@";
"%[genre]@ %[is]@ %@" = "%1$[Genre]@ %2$[is]@ %3$@";
"%[genre]@ %[is not]@ %@" = "%1$[Genre]@ %2$[is not]@ %3$@";
"%[genre]@ %[begins with]@ %@" = "%1$[Genre]@ %2$[begins with]@ %3$@";
"%[genre]@ %[ends with]@ %@" = "%1$[Genre]@ %2$[ends with]@ %3$@";

"%[grouping]@ %[contains]@ %@" = "%1$[Grouping]@ %2$[contains]@ %3$@";
"%[grouping]@ %[does not contain]@ %@" = "%1$[Grouping]@ %2$[does not contain]@ %3$@";
"%[grouping]@ %[is]@ %@" = "%1$[Grouping]@ %2$[is]@ %3$@";
"%[grouping]@ %[is not]@ %@" = "%1$[Grouping]@ %2$[is not]@ %3$@";
"%[grouping]@ %[begins with]@ %@" = "%1$[Grouping]@ %2$[begins with]@ %3$@";
"%[grouping]@ %[ends with]@ %@" = "%1$[Grouping]@ %2$[ends with]@ %3$@";

"%[kind]@ %[contains]@ %@" = "%1$[Kind]@ %2$[contains]@ %3$@";
"%[kind]@ %[does not contain]@ %@" = "%1$[Kind]@ %2$[does not contain]@ %3$@";
"%[kind]@ %[is]@ %@" = "%1$[Kind]@ %2$[is]@ %3$@";
"%[kind]@ %[is not]@ %@" = "%1$[Kind]@ %2$[is not]@ %3$@";
"%[kind]@ %[begins with]@ %@" = "%1$[Kind]@ %2$[begins with]@ %3$@";
"%[kind]@ %[ends with]@ %@" = "%1$[Kind]@ %2$[ends with]@ %3$@";

"%[name]@ %[contains]@ %@" = "%1$[Name]@ %2$[contains]@ %3$@";
"%[name]@ %[does not contain]@ %@" = "%1$[Name]@ %2$[does not contain]@ %3$@";
"%[name]@ %[is]@ %@" = "%1$[Name]@ %2$[is]@ %3$@";
"%[name]@ %[is not]@ %@" = "%1$[Name]@ %2$[is not]@ %3$@";
"%[name]@ %[begins with]@ %@" = "%1$[Name]@ %2$[begins with]@ %3$@";
"%[name]@ %[ends with]@ %@" = "%1$[Name]@ %2$[ends with]@ %3$@";

"%[series_name]@ %[contains]@ %@" = "%1$[Show]@ %2$[contains]@ %3$@";
"%[series_name]@ %[does not contain]@ %@" = "%1$[Show]@ %2$[does not contain]@ %3$@";
"%[series_name]@ %[is]@ %@" = "%1$[Show]@ %2$[is]@ %3$@";
"%[series_name]@ %[is not]@ %@" = "%1$[Show]@ %2$[is not]@ %3$@";
"%[series_name]@ %[begins with]@ %@" = "%1$[Show]@ %2$[begins with]@ %3$@";
"%[series_name]@ %[ends with]@ %@" = "%1$[Show]@ %2$[ends with]@ %3$@";

"%[sort_album]@ %[contains]@ %@" = "%1$[Sort Album]@ %2$[contains]@ %3$@";
"%[sort_album]@ %[does not contain]@ %@" = "%1$[Sort Album]@ %2$[does not contain]@ %3$@";
"%[sort_album]@ %[is]@ %@" = "%1$[Sort Album]@ %2$[is]@ %3$@";
"%[sort_album]@ %[is not]@ %@" = "%1$[Sort Album]@ %2$[is not]@ %3$@";
"%[sort_album]@ %[begins with]@ %@" = "%1$[Sort Album]@ %2$[begins with]@ %3$@";
"%[sort_album]@ %[ends with]@ %@" = "%1$[Sort Album]@ %2$[ends with]@ %3$@";

"%[sort_album_artist]@ %[contains]@ %@" = "%1$[Sort Album Artist]@ %2$[contains]@ %3$@";
"%[sort_album_artist]@ %[does not contain]@ %@" = "%1$[Sort Album Artist]@ %2$[does not contain]@ %3$@";
"%[sort_album_artist]@ %[is]@ %@" = "%1$[Sort Album Artist]@ %2$[is]@ %3$@";
"%[sort_album_artist]@ %[is not]@ %@" = "%1$[Sort Album Artist]@ %2$[is not]@ %3$@";
"%[sort_album_artist]@ %[begins with]@ %@" = "%1$[Sort Album Artist]@ %2$[begins with]@ %3$@";
"%[sort_album_artist]@ %[ends with]@ %@" = "%1$[Sort Album Artist]@ %2$[ends with]@ %3$@";

"%[sort_artist]@ %[contains]@ %@" = "%1$[Sort Artist]@ %2$[contains]@ %3$@";
"%[sort_artist]@ %[does not contain]@ %@" = "%1$[Sort Artist]@ %2$[does not contain]@ %3$@";
"%[sort_artist]@ %[is]@ %@" = "%1$[Sort Artist]@ %2$[is]@ %3$@";
"%[sort_artist]@ %[is not]@ %@" = "%1$[Sort Artist]@ %2$[is not]@ %3$@";
"%[sort_artist]@ %[begins with]@ %@" = "%1$[Sort Artist]@ %2$[begins with]@ %3$@";
"%[sort_artist]@ %[ends with]@ %@" = "%1$[Sort Artist]@ %2$[ends with]@ %3$@";

"%[sort_composer]@ %[contains]@ %@" = "%1$[Sort Composer]@ %2$[contains]@ %3$@";
"%[sort_composer]@ %[does not contain]@ %@" = "%1$[Sort Composer]@ %2$[does not contain]@ %3$@";
"%[sort_composer]@ %[is]@ %@" = "%1$[Sort Composer]@ %2$[is]@ %3$@";
"%[sort_composer]@ %[is not]@ %@" = "%1$[Sort Composer]@ %2$[is not]@ %3$@";
"%[sort_composer]@ %[begins with]@ %@" = "%1$[Sort Composer]@ %2$[begins with]@ %3$@";
"%[sort_composer]@ %[ends with]@ %@" = "%1$[Sort Composer]@ %2$[ends with]@ %3$@";

"%[sort_name]@ %[contains]@ %@" = "%1$[Sort Name]@ %2$[contains]@ %3$@";
"%[sort_name]@ %[does not contain]@ %@" = "%1$[Sort Name]@ %2$[does not contain]@ %3$@";
"%[sort_name]@ %[is]@ %@" = "%1$[Sort Name]@ %2$[is]@ %3$@";
"%[sort_name]@ %[is not]@ %@" = "%1$[Sort Name]@ %2$[is not]@ %3$@";
"%[sort_name]@ %[begins with]@ %@" = "%1$[Sort Name]@ %2$[begins with]@ %3$@";
"%[sort_name]@ %[ends with]@ %@" = "%1$[Sort Name]@ %2$[ends with]@ %3$@";

"%[sort_series_name]@ %[contains]@ %@" = "%1$[Sort Show]@ %2$[contains]@ %3$@";
"%[sort_series_name]@ %[does not contain]@ %@" = "%1$[Sort Show]@ %2$[does not contain]@ %3$@";
"%[sort_series_name]@ %[is]@ %@" = "%1$[Sort Show]@ %2$[is]@ %3$@";
"%[sort_series_name]@ %[is not]@ %@" = "%1$[Sort Show]@ %2$[is not]@ %3$@";
"%[sort_series_name]@ %[begins with]@ %@" = "%1$[Sort Show]@ %2$[begins with]@ %3$@";
"%[sort_series_name]@ %[ends with]@ %@" = "%1$[Sort Show]@ %2$[ends with]@ %3$@";

"%[date_added]@ %[is]@ %@" = "%1$[Date Added]@ %2$[is]@ %3$@";
"%[date_added]@ %[is not]@ %@" = "%1$[Date Added]@ %2$[is not]@ %3$@";
"%[date_added]@ %[is greater than]@ %@" = "%1$[Date Added]@ %2$[is after]@ %3$@";
"%[date_added]@ %[is less than]@ %@" = "%1$[Date Added]@ %2$[is before]@ %3$@";
"%[date_added]@ %[in the last]@ %@ %[days]@" = "%1$[Date Added]@ %2$[in the last]@ %3$@ %4$[days]@";
"%[date_added]@ %[in the last]@ %@ %[weeks]@" = "%1$[Date Added]@ %2$[in the last]@ %3$@ %4$[weeks]@";
"%[date_added]@ %[in the last]@ %@ %[months]@" = "%1$[Date Added]@ %2$[in the last]@ %3$@ %4$[months]@";
"%[date_added]@ %[not in the last]@ %@ %[days]@" = "%1$[Date Added]@ %2$[not in the last]@ %3$@ %4$[days]@";
"%[date_added]@ %[not in the last]@ %@ %[weeks]@" = "%1$[Date Added]@ %2$[not in the last]@ %3$@ %4$[weeks]@";
"%[date_added]@ %[not in the last]@ %@ %[months]@" = "%1$[Date Added]@ %2$[not in the last]@ %3$@ %4$[months]@";
"%[date_added]@ %[is in the range]@ %@ to %@" = "%1$[Date Added]@ %2$[is in the range]@ %3$@ to %4$@";

"%[date_modified]@ %[is]@ %@" = "%1$[Date Modified]@ %2$[is]@ %3$@";
"%[date_modified]@ %[is not]@ %@" = "%1$[Date Modified]@ %2$[is not]@ %3$@";
"%[date_modified]@ %[is greater than]@ %@" = "%1$[Date Modified]@ %2$[is after]@ %3$@";
"%[date_modified]@ %[is less than]@ %@" = "%1$[Date Modified]@ %2$[is before]@ %3$@";
"%[date_modified]@ %[in the last]@ %@ %[days]@" = "%1$[Date Modified]@ %2$[in the last]@ %3$@ %4$[days]@";
"%[date_modified]@ %[in the last]@ %@ %[weeks]@" = "%1$[Date Modified]@ %2$[in the last]@ %3$@ %4$[weeks]@";
"%[date_modified]@ %[in the last]@ %@ %[months]@" = "%1$[Date Modified]@ %2$[in the last]@ %3$@ %4$[months]@";
"%[date_modified]@ %[not in the last]@ %@ %[days]@" = "%1$[Date Modified]@ %2$[not in the last]@ %3$@ %4$[days]@";
"%[date_modified]@ %[not in the last]@ %@ %[weeks]@" = "%1$[Date Modified]@ %2$[not in the last]@ %3$@ %4$[weeks]@";
"%[date_modified]@ %[not in the last]@ %@ %[months]@" = "%1$[Date Modified]@ %2$[not in the last]@ %3$@ %4$[months]@";
"%[date_modified]@ %[is in the range]@ %@ to %@" = "%1$[Date Modified]@ %2$[is in the range]@ %3$@ to %4$@";

"%[playdate]@ %[is]@ %@" = "%1$[Last Played]@ %2$[is]@ %3$@";
"%[playdate]@ %[is not]@ %@" = "%1$[Last Played]@ %2$[is not]@ %3$@";
"%[playdate]@ %[is greater than]@ %@" = "%1$[Last Played]@ %2$[is after]@ %3$@";
"%[playdate]@ %[is less than]@ %@" = "%1$[Last Played]@ %2$[is before]@ %3$@";
"%[playdate]@ %[in the last]@ %@ %[days]@" = "%1$[Last Played]@ %2$[in the last]@ %3$@ %4$[days]@";
"%[playdate]@ %[in the last]@ %@ %[weeks]@" = "%1$[Last Played]@ %2$[in the last]@ %3$@ %4$[weeks]@";
"%[playdate]@ %[in the last]@ %@ %[months]@" = "%1$[Last Played]@ %2$[in the last]@ %3$@ %4$[months]@";
"%[playdate]@ %[not in the last]@ %@ %[days]@" = "%1$[Last Played]@ %2$[not in the last]@ %3$@ %4$[days]@";
"%[playdate]@ %[not in the last]@ %@ %[weeks]@" = "%1$[Last Played]@ %2$[not in the last]@ %3$@ %4$[weeks]@";
"%[playdate]@ %[not in the last]@ %@ %[months]@" = "%1$[Last Played]@ %2$[not in the last]@ %3$@ %4$[months]@";
"%[playdate]@ %[is in the range]@ %@ to %@" = "%1$[Last Played]@ %2$[is in the range]@ %3$@ to %4$@";

"%[skipdate]@ %[is]@ %@" = "%1$[Last Skipped]@ %2$[is]@ %3$@";
"%[skipdate]@ %[is not]@ %@" = "%1$[Last Skipped]@ %2$[is not]@ %3$@";
"%[skipdate]@ %[is greater than]@ %@" = "%1$[Last Skipped]@ %2$[is after]@ %3$@";
"%[skipdate]@ %[is less than]@ %@" = "%1$[Last Skipped]@ %2$[is before]@ %3$@";
"%[skipdate]@ %[in the last]@ %@ %[days]@" = "%1$[Last Skipped]@ %2$[in the last]@ %3$@ %4$[days]@";
"%[skipdate]@ %[in the last]@ %@ %[weeks]@" = "%1$[Last Skipped]@ %2$[in the last]@ %3$@ %4$[weeks]@";
"%[skipdate]@ %[in the last]@ %@ %[months]@" = "%1$[Last Skipped]@ %2$[in the last]@ %3$@ %4$[months]@";
"%[skipdate]@ %[not in the last]@ %@ %[days]@" = "%1$[Last Skipped]@ %2$[not in the last]@ %3$@ %4$[days]@";
"%[skipdate]@ %[not in the last]@ %@ %[weeks]@" = "%1$[Last Skipped]@ %2$[not in the last]@ %3$@ %4$[weeks]@";
"%[skipdate]@ %[not in the last]@ %@ %[months]@" = "%1$[Last Skipped]@ %2$[not in the last]@ %3$@ %4$[months]@";
"%[skipdate]@ %[is in the range]@ %@ to %@" = "%1$[Last Skipped]@ %2$[is in the range]@ %3$@ to %4$@";

"%[songid]@ %[is]@" = "%1$[Purchased]@ %2$[is true]@";
"%[songid]@ %[is not]@" = "%1$[Purchased]@ %2$[is false]@";

"%[olduserdisabled]@ %[is]@" = "%1$[Checked]@ %2$[is true]@";
"%[olduserdisabled]@ %[is not]@" = "%1$[Checked]@ %2$[is false]@";

"%[artwork]@ %[is]@" = "%1$[Album Artwork]@ %2$[is true]@";
"%[artwork]@ %[is not]@" = "%1$[Album Artwork]@ %2$[is false]@";

"%[compilation]@ %[is]@" = "%1$[Compilation]@ %2$[is true]@";
"%[compilation]@ %[is not]@" = "%1$[Compilation]@ %2$[is false]@";

"%[totaltime]@ %[is]@ %@" = "%1$[Time]@ %2$[is]@ %3$@";
"%[totaltime]@ %[is not]@ %@" = "%1$[Time]@ %2$[is not]@ %3$@";
"%[totaltime]@ %[is greater than]@ %@" = "%1$[Time]@ %2$[is greater than]@ %3$@";
"%[totaltime]@ %[is less than]@ %@" = "%1$[Time]@ %2$[is less than]@ %3$@";
"%[totaltime]@ %[is in the range]@ %@ to %@" = "%1$[Time]@ %2$[is in the range]@ %3$@ to %4$@";

"%[albumrating]@ %[is]@ %@" = "%1$[Album Rating]@ %2$[is]@ %3$@";
"%[albumrating]@ %[is not]@ %@" = "%1$[Album Rating]@ %2$[is not]@ %3$@";
"%[albumrating]@ %[is greater than]@ %@" = "%1$[Album Rating]@ %2$[is greater than]@ %3$@";
"%[albumrating]@ %[is less than]@ %@" = "%1$[Album Rating]@ %2$[is less than]@ %3$@";
"%[albumrating]@ %[is in the range]@ %@ to %@" = "%1$[Album Rating]@ %2$[is in the range]@ %3$@ to %4$@";

"%[trackrating]@ %[is]@ %@" = "%1$[Rating]@ %2$[is]@ %3$@";
"%[trackrating]@ %[is not]@ %@" = "%1$[Rating]@ %2$[is not]@ %3$@";
"%[trackrating]@ %[is greater than]@ %@" = "%1$[Rating]@ %2$[is greater than]@ %3$@";
"%[trackrating]@ %[is less than]@ %@" = "%1$[Rating]@ %2$[is less than]@ %3$@";
"%[trackrating]@ %[is in the range]@ %@ to %@" = "%1$[Rating]@ %2$[is in the range]@ %3$@ to %4$@";

"%[mediakind]@ %[is]@ %[Music]@" = "%1$[Media Kind]@ %2$[is]@ %3$[Music]@";
"%[mediakind]@ %[is]@ %[Music Video]@" = "%1$[Media Kind]@ %2$[is]@ %3$[Music Video]@";
"%[mediakind]@ %[is]@ %[Movie]@" = "%1$[Media Kind]@ %2$[is]@ %3$[Movie]@";
"%[mediakind]@ %[is]@ %[TV Show]@" = "%1$[Media Kind]@ %2$[is]@ %3$[TV Show]@";
"%[mediakind]@ %[is]@ %[Podcast]@" = "%1$[Media Kind]@ %2$[is]@ %3$[Podcast]@";
"%[mediakind]@ %[is]@ %[iTunes U]@" = "%1$[Media Kind]@ %2$[is]@ %3$[iTunes U]@";
"%[mediakind]@ %[is]@ %[Audiobook]@" = "%1$[Media Kind]@ %2$[is]@ %3$[Audiobook]@";
"%[mediakind]@ %[is]@ %[Book]@" = "%1$[Media Kind]@ %2$[is]@ %3$[Book]@";
"%[mediakind]@ %[is]@ %[Voice Memo]@" = "%1$[Media Kind]@ %2$[is]@ %3$[Voice Memo]@";
"%[mediakind]@ %[is]@ %[iTunes Extras]@" = "%1$[Media Kind]@ %2$[is]@ %3$[iTunes Extras]@";
"%[mediakind]@ %[is not]@ %[Music]@" = "%1$[Media Kind]@ %2$[is not]@ %3$[Music]@";
"%[mediakind]@ %[is not]@ %[Music Video]@" = "%1$[Media Kind]@ %2$[is not]@ %3$[Music Video]@";
"%[mediakind]@ %[is not]@ %[Movie]@" = "%1$[Media Kind]@ %2$[is not]@ %3$[Movie]@";
"%[mediakind]@ %[is not]@ %[TV Show]@" = "%1$[Media Kind]@ %2$[is not]@ %3$[TV Show]@";
"%[mediakind]@ %[is not]@ %[Podcast]@" = "%1$[Media Kind]@ %2$[is not]@ %3$[Podcast]@";
"%[mediakind]@ %[is not]@ %[iTunes U]@" = "%1$[Media Kind]@ %2$[is not]@ %3$[iTunes U]@";
"%[mediakind]@ %[is not]@ %[Audiobook]@" = "%1$[Media Kind]@ %2$[is not]@ %3$[Audiobook]@";
"%[mediakind]@ %[is not]@ %[Book]@" = "%1$[Media Kind]@ %2$[is not]@ %3$[Book]@";
"%[mediakind]@ %[is not]@ %[Voice Memo]@" = "%1$[Media Kind]@ %2$[is not]@ %3$[Voice Memo]@";
"%[mediakind]@ %[is not]@ %[iTunes Extras]@" = "%1$[Media Kind]@ %2$[is not]@ %3$[iTunes Extras]@";

"%[playlistpersistentid]@ %[is]@ %@" = "%1$[Playlist]@ %2$[is]@ %3$@";
"%[playlistpersistentid]@ %[is not]@ %@" = "%1$[Playlist]@ %2$[is not]@ %3$@";

"%[trackkinds]@ %[is]@ %[local]@" = "%1$[Location]@ %2$[is]@ %3$[on this computer]@";
"%[trackkinds]@ %[is]@ %[iCloud]@" = "%1$[Location]@ %2$[is]@ %3$[iCloud]@";
"%[trackkinds]@ %[is not]@ %[local]@" = "%1$[Location]@ %2$[is not]@ %3$[on this computer]@";
"%[trackkinds]@ %[is not]@ %[iCloud]@" = "%1$[Location]@ %2$[is not]@ %3$[iCloud]@";

"%[icloudstatus]@ %[is]@ %[Matched]@" = "%1$[iCloud Status]@ %2$[is]@ %3$[Matched]@";
"%[icloudstatus]@ %[is]@ %[Purchased]@" = "%1$[iCloud Status]@ %2$[is]@ %3$[Purchased]@";
"%[icloudstatus]@ %[is]@ %[Uploaded]@" = "%1$[iCloud Status]@ %2$[is]@ %3$[Uploaded]@";
"%[icloudstatus]@ %[is]@ %[Ineligible]@" = "%1$[iCloud Status]@ %2$[is]@ %3$[Ineligible]@";
"%[icloudstatus]@ %[is]@ %[Local Only]@" = "%1$[iCloud Status]@ %2$[is]@ %3$[Local Only]@";
"%[icloudstatus]@ %[is]@ %[Error]@" = "%1$[iCloud Status]@ %2$[is]@ %3$[Error]@";
"%[icloudstatus]@ %[is]@ %[Duplicate]@" = "%1$[iCloud Status]@ %2$[is]@ %3$[Duplicate]@";
"%[icloudstatus]@ %[is not]@ %[Matched]@" = "%1$[iCloud Status]@ %2$[is not]@ %3$[Matched]@";
"%[icloudstatus]@ %[is not]@ %[Purchased]@" = "%1$[iCloud Status]@ %2$[is not]@ %3$[Purchased]@";
"%[icloudstatus]@ %[is not]@ %[Uploaded]@" = "%1$[iCloud Status]@ %2$[is not]@ %3$[Uploaded]@";
"%[icloudstatus]@ %[is not]@ %[Ineligible]@" = "%1$[iCloud Status]@ %2$[is not]@ %3$[Ineligible]@";
"%[icloudstatus]@ %[is not]@ %[Local Only]@" = "%1$[iCloud Status]@ %2$[is not]@ %3$[Local Only]@";
"%[icloudstatus]@ %[is not]@ %[Error]@" = "%1$[iCloud Status]@ %2$[is not]@ %3$[Error]@";
"%[icloudstatus]@ %[is not]@ %[Duplicate]@" = "%1$[iCloud Status]@ %2$[is not]@ %3$[Duplicate]@";
